In [122]:
import pandas as pd
import numpy as np

In [123]:
filename1='C:/it_dspydsdj_06_enus_code/visualizations/datasets/objects.csv'

In [124]:
objects_data=pd.read_csv(filename1)

In [125]:
objects_data

    object      shape  colour  quantity
0   mirror     circle  silver         1
1    wheel     circle  silver         4
2    lemon     circle  yellow         4
3      box     square   brown         3
4    bread     square   white        10
5    towel  rectangle   white         2
6   laptop  rectangle   black         1
7      pen  rectangle    blue         7
8   bottle  rectangle     red         6
9  biscuit  rectangle   brown        20

In [5]:
shape_data=objects_data.groupby('shape')
shape_data

In [6]:
shape_data.first()

           object  colour  quantity
shape
circle     mirror  silver         1
rectangle   towel   white         2
square        box   brown         3

In [7]:
shape_data.get_group('square')

  object colour  quantity
3    box  brown         3
4  bread  white        10

In [8]:
shape_data.get_group('rectangle')

    object colour  quantity
5    towel  white         2
6   laptop  black         1
7      pen   blue         7
8   bottle    red         6
9  biscuit  brown        20

In [9]:
shape_data['quantity'].sum()

shape
circle        9
rectangle    36
square       13
Name: quantity, dtype: int64

In [10]:
colour_data=objects_data.groupby('colour')
colour_data

In [11]:
colour_data.first()

        object      shape  quantity
colour
black   laptop  rectangle         1
blue       pen  rectangle         7
brown      box     square         3
red     bottle  rectangle         6
silver  mirror     circle         1
white    bread     square        10
yellow   lemon     circle         4

In [12]:
colour_data.get_group('black')

   object      shape  quantity
6  laptop  rectangle         1

In [13]:
colour_data.quantity.mean()

colour
black      1.0
blue       7.0
brown     11.5
red        6.0
silver     2.5
white      6.0
yellow     4.0
Name: quantity, dtype: float64

In [14]:
colour_data=objects_data.groupby('colour',sort=False)
colour_data.quantity.mean()

colour
silver     2.5
yellow     4.0
brown     11.5
white      6.0
black      1.0
blue       7.0
red        6.0
Name: quantity, dtype: float64

# Multiindex Data Frames

In [15]:
array=objects_data.values

In [16]:
array=array.T.tolist()
array

[['mirror',
  'wheel',
  'lemon',
  'box',
  'bread',
  'towel',
  'laptop',
  'pen',
  'bottle',
  'biscuit'],
 ['circle',
  'circle',
  'circle',
  'square',
  'square',
  'rectangle',
  'rectangle',
  'rectangle',
  'rectangle',
  'rectangle'],
 ['silver',
  'silver',
  'yellow',
  'brown',
  'white',
  'white',
  'black',
  'blue',
  'red',
  'brown'],
 [1, 4, 4, 3, 10, 2, 1, 7, 6, 20]]

In [17]:
array_index=array[1:3]

In [18]:
array_index

[['circle',
  'circle',
  'circle',
  'square',
  'square',
  'rectangle',
  'rectangle',
  'rectangle',
  'rectangle',
  'rectangle'],
 ['silver',
  'silver',
  'yellow',
  'brown',
  'white',
  'white',
  'black',
  'blue',
  'red',
  'brown']]

In [19]:
index=pd.MultiIndex.from_arrays(array_index,names=['shape','colour'])
index

MultiIndex([(   'circle', 'silver'),
            (   'circle', 'silver'),
            (   'circle', 'yellow'),
            (   'square',  'brown'),
            (   'square',  'white'),
            ('rectangle',  'white'),
            ('rectangle',  'black'),
            ('rectangle',   'blue'),
            ('rectangle',    'red'),
            ('rectangle',  'brown')],
           names=['shape', 'colour'])

In [20]:
multi_data=pd.DataFrame({'objects':array[0],'quantity':array[3]},index=index)

In [21]:
multi_data

                  objects  quantity
shape     colour
circle    silver   mirror         1
          silver    wheel         4
          yellow    lemon         4
square    brown       box         3
          white     bread        10
rectangle white     towel         2
          black    laptop         1
          blue        pen         7
          red      bottle         6
          brown   biscuit        20

# Grouping and Aggregations with Multiindex DataFrames

In [22]:
multi_data.groupby(level='shape').sum()

           quantity
shape
circle            9
rectangle        36
square           13

In [23]:
multi_data.groupby(level='colour').sum()

        quantity
colour
black          1
blue           7
brown         23
red            6
silver         5
white         12
yellow         4

In [24]:
multi_data.groupby(level=['colour','shape']).sum()

                  quantity
colour shape
black  rectangle         1
blue   rectangle         7
brown  rectangle        20
       square            3
red    rectangle         6
silver circle            5
white  rectangle         2
       square           10
yellow circle            4

In [25]:
multi_data.groupby(level=['colour','shape']).get_group(('white' ,'rectangle'))

                 objects  quantity
shape     colour
rectangle white    towel         2

In [26]:
multi_data.groupby([pd.Grouper(level='colour'),'shape']).get_group(('white' ,'rectangle'))

                 objects  quantity
shape     colour
rectangle white    towel         2

In [27]:
multi_data.groupby([pd.Grouper(level=0),'colour']).get_group(('rectangle' ,'white'))

                 objects  quantity
shape     colour
rectangle white    towel         2

In [28]:
for name,group in objects_data.groupby('colour'):
    print('name:',name)
    print('group:',group)

name: black
group:    object      shape colour  quantity
6  laptop  rectangle  black         1
name: blue
group:   object      shape colour  quantity
7    pen  rectangle   blue         7
name: brown
group:     object      shape colour  quantity
3      box     square  brown         3
9  biscuit  rectangle  brown        20
name: red
group:    object      shape colour  quantity
8  bottle  rectangle    red         6
name: silver
group:    object   shape  colour  quantity
0  mirror  circle  silver         1
1   wheel  circle  silver         4
name: white
group:   object      shape colour  quantity
4  bread     square  white        10
5  towel  rectangle  white         2
name: yellow
group:   object   shape  colour  quantity
2  lemon  circle  yellow         4

In [29]:
multi_data.groupby(level=['colour','shape']).size()

colour  shape
black   rectangle    1
blue    rectangle    1
brown   rectangle    1
        square       1
red     rectangle    1
silver  circle       2
white   rectangle    1
        square       1
yellow  circle       1
dtype: int64

In [30]:
multi_data.groupby(level=['colour','shape']).describe()

                 quantity
                    count  mean      std   min    25%   50%    75%   max
colour shape
black  rectangle      1.0   1.0      NaN   1.0   1.00   1.0   1.00   1.0
blue   rectangle      1.0   7.0      NaN   7.0   7.00   7.0   7.00   7.0
brown  rectangle      1.0  20.0      NaN  20.0  20.00  20.0  20.00  20.0
       square         1.0   3.0      NaN   3.0   3.00   3.0   3.00   3.0
red    rectangle      1.0   6.0      NaN   6.0   6.00   6.0   6.00   6.0
silver circle         2.0   2.5  2.12132   1.0   1.75   2.5   3.25   4.0
white  rectangle      1.0   2.0      NaN   2.0   2.00   2.0   2.00   2.0
       square         1.0  10.0      NaN  10.0  10.00  10.0  10.00  10.0
yellow circle         1.0   4.0      NaN   4.0   4.00   4.0   4.00   4.0

In [31]:
multi_data.groupby(level=['shape']).aggregate(np.sum)

           quantity
shape
circle            9
rectangle        36
square           13

In [32]:
multi_data.groupby(level=['shape','colour']).aggregate(np.sum)

                  quantity
shape     colour
circle    silver         5
          yellow         4
rectangle black          1
          blue           7
          brown         20
          red            6
          white          2
square    brown          3
          white         10

In [33]:
multi_data.groupby(level=['shape'],as_index=False).agg([np.sum,np.mean,np.min,np.max])

          quantity
               sum mean amin amax
shape
circle           9  3.0    1    4
rectangle       36  7.2    1   20
square          13  6.5    3   10

In [34]:
multi_data.groupby(level=['shape']).agg({'quantity':np.sum,'objects':np.max})

           quantity objects
shape
circle            9   wheel
rectangle        36   towel
square           13   bread

In [35]:
multi_data.groupby(level=['shape']).transform(lambda x:x.mean())

                  quantity
shape     colour
circle    silver       3.0
          silver       3.0
          yellow       3.0
square    brown        6.5
          white        6.5
rectangle white        7.2
          black        7.2
          blue         7.2
          red          7.2
          brown        7.2

In [36]:
multi_data['average']=multi_data.groupby(level=['shape']).transform(lambda x:x.mean())

In [37]:
multi_data

                  objects  quantity  average
shape     colour
circle    silver   mirror         1      3.0
          silver    wheel         4      3.0
          yellow    lemon         4      3.0
square    brown       box         3      6.5
          white     bread        10      6.5
rectangle white     towel         2      7.2
          black    laptop         1      7.2
          blue        pen         7      7.2
          red      bottle         6      7.2
          brown   biscuit        20      7.2

# Filtering

In [38]:
filename2='C:/it_dspydsdj_06_enus_code/visualizations/datasets/StudentsPerformance.csv'

In [39]:
perf_data=pd.read_csv(filename2)

In [40]:
perf_data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [41]:
gender_filter=perf_data['gender'].isin(['female'])
gender_filter.head(10)

0     True
1     True
2     True
3    False
4    False
5     True
6     True
7    False
8    False
9     True
Name: gender, dtype: bool

In [42]:
perf_data[gender_filter] #gender filter is used as a filter to filter out only female students

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [43]:
perf_data[~gender_filter]     # tilder notation is used to flip the values of the columns

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
10,male,group C,associate's degree,standard,none,58,54,52
...,...,...,...,...,...,...,...,...
985,male,group A,high school,standard,none,57,51,54
987,male,group E,some high school,standard,completed,81,75,76
990,male,group E,high school,free/reduced,completed,86,81,75
994,male,group A,high school,standard,none,63,63,62
996,male,group C,high school,free/reduced,none,62,55,55

In [44]:
condition=(perf_data['gender'].isin(['female'])) & (perf_data['reading score']>perf_data['writing score']) 
condition

0      False
1       True
2       True
3      False
4      False
       ...
995     True
996    False
997     True
998     True
999    False
Length: 1000, dtype: bool

In [45]:
course_filter=perf_data['test preparation course'].isin(['completed'])

In [46]:
course_filter

0      False
1       True
2      False
3      False
4      False
       ...
995     True
996    False
997     True
998     True
999    False
Name: test preparation course, Length: 1000, dtype: bool

In [47]:
perf_data[gender_filter & course_filter]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
1,female,group C,some college,standard,completed,69,90,88
6,female,group B,some college,standard,completed,88,95,92
21,female,group B,some college,free/reduced,completed,65,75,70
38,female,group D,associate's degree,free/reduced,completed,75,90,88
46,female,group A,associate's degree,standard,completed,55,65,62
...,...,...,...,...,...,...,...,...
989,female,group D,some college,free/reduced,completed,67,86,83
991,female,group B,some high school,standard,completed,65,82,78
995,female,group E,master's degree,standard,completed,88,99,95
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77

In [48]:
education_levels=["associate's degree","bachelor's degree"]

In [49]:
parent_filter=perf_data['parental level of education'].isin(education_levels)
parent_filter

0       True
1      False
2      False
3       True
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: parental level of education, Length: 1000, dtype: bool

In [50]:
perf_data[parent_filter]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
3,male,group A,associate's degree,free/reduced,none,47,57,44
5,female,group B,associate's degree,standard,none,71,83,78
10,male,group C,associate's degree,standard,none,58,54,52
11,male,group D,associate's degree,standard,none,40,52,43
...,...,...,...,...,...,...,...,...
977,male,group C,associate's degree,standard,none,62,65,58
979,female,group C,associate's degree,standard,none,91,95,94
986,female,group C,associate's degree,standard,none,40,59,51
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74

In [51]:
perf_data.filter(items=['gender','test preparation course','math score','reading score','writing score'])

     gender test preparation course  math score  reading score  writing score
0    female                    none          72             72             74
1    female               completed          69             90             88
2    female                    none          90             95             93
3      male                    none          47             57             44
4      male                    none          76             78             75
..      ...                     ...         ...            ...            ...
995  female               completed          88             99             95
996    male                    none          62             55             55
997  female               completed          59             71             65
998  female               completed          68             78             77
999  female                    none          77             86             86

[1000 rows x 5 columns]

In [52]:
perf_data.filter(regex='score',axis=1)

     math score  reading score  writing score
0            72             72             74
1            69             90             88
2            90             95             93
3            47             57             44
4            76             78             75
..          ...            ...            ...
995          88             99             95
996          62             55             55
997          59             71             65
998          68             78             77
999          77             86             86

[1000 rows x 3 columns]

In [53]:
perf_data.filter(like='14',axis=0)      # all of the index that contains 14 in them are filtered out

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
14,female,group A,master's degree,standard,none,50,53,58
114,female,group E,bachelor's degree,standard,completed,99,100,100
140,female,group D,some high school,standard,none,76,72,71
141,female,group C,some college,free/reduced,none,59,62,64
142,female,group E,some college,free/reduced,completed,42,55,54
143,male,group A,high school,standard,none,57,43,47
144,male,group D,some college,standard,none,88,73,78
145,female,group C,some college,free/reduced,none,22,39,33
146,male,group B,some high school,standard,none,88,84,75
147,male,group C,associate's degree,free/reduced,none,73,68,66
148,female,group D,bachelor's degree,standard,completed,68,75,81
149,male,group E,associate's degree,free/reduced,completed,100,100,93
214,male,group E,high school,standard,completed,87,91,81
314,female,group C,bachelor's degree,standard,completed,59,64,75
414,female,group C,bachelor's degree,free/reduced,completed,51,72,79
514,female,group B,master's degree,free/reduced,completed,77,97,94
614,female,group A,associate's degree,standard,none,82,93,93
714,female,group B,some high school,standard,completed,60,70,74
814,female,group C,high school,standard,none,72,80,83
914,female,group B,associate's degree,free/reduced,none,46,61,55

In [54]:
groupA=perf_data['race/ethnicity']=='group A'
perf_data[groupA].head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
13,male,group A,some college,standard,completed,78,72,70
14,female,group A,master's degree,standard,none,50,53,58
25,male,group A,master's degree,free/reduced,none,73,74,72
46,female,group A,associate's degree,standard,completed,55,65,62
61,male,group A,some high school,free/reduced,none,39,39,34
62,male,group A,associate's degree,free/reduced,none,62,61,55
72,female,group A,associate's degree,free/reduced,none,41,51,48
77,male,group A,bachelor's degree,standard,completed,80,78,81
82,male,group A,some college,free/reduced,completed,50,47,54

# Duplicate Values

In [55]:
sample_list=pd.Series(range(10))

In [56]:
sample_list

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [57]:
sample_list[sample_list<3]

0    0
1    1
2    2
dtype: int64

In [58]:
sample_list.where(sample_list<3)        #masking takes place for elements which do not satisfy the condition

0    0.0
1    1.0
2    2.0
3    NaN
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: float64

In [59]:
sample_list.mask(sample_list<3)

0    NaN
1    NaN
2    NaN
3    3.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [60]:
sample_list.where(sample_list<3,'x')

0    0
1    1
2    2
3    x
4    x
5    x
6    x
7    x
8    x
9    x
dtype: object

In [61]:
sample_list.where(sample_list<3,'x') == pd.Series(range(10))

0     True
1     True
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

# Working with Duplicates

In [62]:
df=pd.DataFrame({'color':['red','yellow','green','yellow','blue','green','green'], 'vehicle':['truck','bus','van','truck','bus','van','car']})

In [63]:
df

    color vehicle
0     red   truck
1  yellow     bus
2   green     van
3  yellow   truck
4    blue     bus
5   green     van
6   green     car

In [64]:
df.duplicated('color')  # This function is used to find the no of duplicates in a column

0    False
1    False
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [65]:
df.drop_duplicates('color')

    color vehicle
0     red   truck
1  yellow     bus
2   green     van
4    blue     bus

In [66]:
df.drop_duplicates('color',keep='first')

    color vehicle
0     red   truck
1  yellow     bus
2   green     van
4    blue     bus

In [67]:
df.drop_duplicates('color',keep='last')

    color vehicle
0     red   truck
3  yellow   truck
4    blue     bus
6   green     car

In [68]:
df.drop_duplicates('color',keep=False)

  color vehicle
0   red   truck
4  blue     bus

In [69]:
df.drop_duplicates(['color','vehicle'])

    color vehicle
0     red   truck
1  yellow     bus
2   green     van
3  yellow   truck
4    blue     bus
6   green     car

In [70]:
df.drop_duplicates(keep=False)

    color vehicle
0     red   truck
1  yellow     bus
3  yellow   truck
4    blue     bus
6   green     car

In [71]:
pd.crosstab(df['color'],df['vehicle'],margins=True)

vehicle  bus  car  truck  van  All
color
blue       1    0      0    0    1
green      0    1      0    2    3
red        0    0      1    0    1
yellow     1    0      1    0    2
All        2    1      2    2    7

# Working with Categorical Datas

In [72]:
df['Size']=df['Size'].astype('category')

KeyError: 'Size'

In [73]:
categorical_series=pd.Series(['Cotton','Polyester','Wool'],dtype='category')

In [74]:
categorical_series

0       Cotton
1    Polyester
2         Wool
dtype: category
Categories (3, object): ['Cotton', 'Polyester', 'Wool']

In [75]:
categorical_series=pd.Series(['Cotton','Polyester','Wool','Cotton'],dtype="category")

In [76]:
df=pd.DataFrame({"Material":['Cotton','Polyester','Wool','Silk'],
               "Garment":['T-Shirt','Jacket','Socks','Scarf'],
               "Size":['Medium','Large','Large','Small']},dtype='category')

In [77]:
df

    Material  Garment    Size
0     Cotton  T-Shirt  Medium
1  Polyester   Jacket   Large
2       Wool    Socks   Large
3       Silk    Scarf   Small

In [78]:
df.dtypes

Material    category
Garment     category
Size        category
dtype: object

In [79]:
df['Material_cat']=df['Material'].astype('category')

In [80]:
df.dtypes

Material        category
Garment         category
Size            category
Material_cat    category
dtype: object

In [81]:
df['Size']

0    Medium
1     Large
2     Large
3     Small
Name: Size, dtype: category
Categories (3, object): ['Large', 'Medium', 'Small']

In [82]:
from pandas.api.types import CategoricalDtype as CDT

In [83]:
materials=CDT(categories=['Cotton','Polyester','Wool','Silk'],ordered=True)

In [84]:
materials

CategoricalDtype(categories=['Cotton', 'Polyester', 'Wool', 'Silk'], ordered=True)

In [85]:
sizes=CDT(categories=['Small','Medium','Large'],ordered=True)

In [86]:
sizes

CategoricalDtype(categories=['Small', 'Medium', 'Large'], ordered=True)

In [87]:
list_series=pd.Series(['Medium','Small','X-Large','Small'])
list_series.astype(sizes)

0    Medium
1     Small
2       NaN
3     Small
dtype: category
Categories (3, object): ['Small' < 'Medium' < 'Large']

In [88]:
df=pd.DataFrame({"Material":['Cotton','Polyester','Wool','Silk'],
               "Garment":['T-Shirt','Jacket','Socks','Scarf'],
               "Size":['Medium','Large','Large','Small']})

In [89]:
df

    Material  Garment    Size
0     Cotton  T-Shirt  Medium
1  Polyester   Jacket   Large
2       Wool    Socks   Large
3       Silk    Scarf   Small

In [90]:
df['Material']=df['Material'].astype(materials)
df['Size']=df['Size'].astype(sizes)

In [91]:
df

    Material  Garment    Size
0     Cotton  T-Shirt  Medium
1  Polyester   Jacket   Large
2       Wool    Socks   Large
3       Silk    Scarf   Small

In [92]:
df['Material']

0       Cotton
1    Polyester
2         Wool
3         Silk
Name: Material, dtype: category
Categories (4, object): ['Cotton' < 'Polyester' < 'Wool' < 'Silk']

In [93]:
df['Size']

0    Medium
1     Large
2     Large
3     Small
Name: Size, dtype: category
Categories (3, object): ['Small' < 'Medium' < 'Large']

In [94]:
df['Garment']

0    T-Shirt
1     Jacket
2      Socks
3      Scarf
Name: Garment, dtype: object

# Filtering, Adding and removing categorical data

In [95]:
df[df['Material']=='Cotton']

  Material  Garment    Size
0   Cotton  T-Shirt  Medium

In [96]:
df[df['Size']=='Large']

    Material Garment   Size
1  Polyester  Jacket  Large
2       Wool   Socks  Large

In [97]:
df[df['Size']>'Small']

    Material  Garment    Size
0     Cotton  T-Shirt  Medium
1  Polyester   Jacket   Large
2       Wool    Socks   Large

In [98]:
df[df['Garment']>'Scarf']

  Material  Garment    Size
0   Cotton  T-Shirt  Medium
2     Wool    Socks   Large

In [99]:
df['Garment']=df['Garment'].astype('category')
df['Garment']

0    T-Shirt
1     Jacket
2      Socks
3      Scarf
Name: Garment, dtype: category
Categories (4, object): ['Jacket', 'Scarf', 'Socks', 'T-Shirt']

In [100]:
df[df['Garment']=='Scarf']

  Material Garment   Size
3     Silk   Scarf  Small

In [101]:
df[df['Garment']>'Scarf']

TypeError: Unordered Categoricals can only compare equality or not

In [102]:
df.sort_values(by='Size')

    Material  Garment    Size
3       Silk    Scarf   Small
0     Cotton  T-Shirt  Medium
1  Polyester   Jacket   Large
2       Wool    Socks   Large

In [103]:
df['Size'].cat.categories

Index(['Small', 'Medium', 'Large'], dtype='object')

In [104]:
df['Size']=df['Size'].cat.add_categories(['X-Large', 'XX-Large'])
df['Size']

0    Medium
1     Large
2     Large
3     Small
Name: Size, dtype: category
Categories (5, object): ['Small' < 'Medium' < 'Large' < 'X-Large' < 'XX-Large']

In [105]:
df['Material']=df['Material'].cat.add_categories(['Bamboo'])

In [106]:
df['Material']

0       Cotton
1    Polyester
2         Wool
3         Silk
Name: Material, dtype: category
Categories (5, object): ['Cotton' < 'Polyester' < 'Wool' < 'Silk' < 'Bamboo']

In [107]:
df['Size']=df['Size'].cat.remove_categories(['Small'])

In [108]:
df['Size'].cat.remove_unused_categories()
df['Size']

0    Medium
1     Large
2     Large
3       NaN
Name: Size, dtype: category
Categories (4, object): ['Medium' < 'Large' < 'X-Large' < 'XX-Large']

In [109]:
df['Size']=df['Size'].cat.set_categories(['X-Small','Small','Medium'])  #The data which is not a part of our category is denoted as Nan
df['Size']

0    Medium
1       NaN
2       NaN
3       NaN
Name: Size, dtype: category
Categories (3, object): ['X-Small' < 'Small' < 'Medium']

# Reindexing

In [110]:
candy_bars=pd.DataFrame({'name':['Snickers','Dairy Milk','KitKat','Oh Henry!','Ferrero Rocher'],
                        'company':['Mars','Cadbury','Nestle','Nestle','Ferrero SpA'],
                        'cover':['brown','purple','red','yellow','gold']})

In [111]:
candy_bars

             name      company   cover
0        Snickers         Mars   brown
1      Dairy Milk      Cadbury  purple
2          KitKat       Nestle     red
3       Oh Henry!       Nestle  yellow
4  Ferrero Rocher  Ferrero SpA    gold

In [112]:
candy_reindexed=candy_bars.reindex(index=[0,1,3],columns=['name','company'])
candy_reindexed

         name  company
0    Snickers     Mars
1  Dairy Milk  Cadbury
3   Oh Henry!   Nestle

In [113]:
candy_reindexed=candy_bars.reindex(index=[0,1,3,5,6],columns=['name','company','rating'])
candy_reindexed

         name  company rating
0    Snickers     Mars    NaN
1  Dairy Milk  Cadbury    NaN
3   Oh Henry!   Nestle    NaN
5         NaN      NaN    NaN
6         NaN      NaN    NaN

In [118]:
df=pd.DataFrame({'name':['name1','name2','name3','name4','name5','name6','name7','name8'],
               'company':['A','B','C','D','E','F','G','H']},index=[-2,-1,0,1,2,3,4,5])
df

     name company
-2  name1       A
-1  name2       B
 0  name3       C
 1  name4       D
 2  name5       E
 3  name6       F
 4  name7       G
 5  name8       H

In [119]:
candy_bars_reindexed_like=candy_bars.reindex_like(df)
candy_bars_reindexed_like

              name      company
-2             NaN          NaN
-1             NaN          NaN
 0        Snickers         Mars
 1      Dairy Milk      Cadbury
 2          KitKat       Nestle
 3       Oh Henry!       Nestle
 4  Ferrero Rocher  Ferrero SpA
 5             NaN          NaN

In [120]:
candy_bars_reindexed_like.ffill()

              name      company
-2             NaN          NaN
-1             NaN          NaN
 0        Snickers         Mars
 1      Dairy Milk      Cadbury
 2          KitKat       Nestle
 3       Oh Henry!       Nestle
 4  Ferrero Rocher  Ferrero SpA
 5  Ferrero Rocher  Ferrero SpA

In [121]:
candy_bars_reindexed_like.bfill()

              name      company
-2        Snickers         Mars
-1        Snickers         Mars
 0        Snickers         Mars
 1      Dairy Milk      Cadbury
 2          KitKat       Nestle
 3       Oh Henry!       Nestle
 4  Ferrero Rocher  Ferrero SpA
 5             NaN          NaN

In [127]:
df.values

array([['name1', 'A'],
       ['name2', 'B'],
       ['name3', 'C'],
       ['name4', 'D'],
       ['name5', 'E'],
       ['name6', 'F'],
       ['name7', 'G'],
       ['name8', 'H']], dtype=object)